#+OPTIONS: num:nil ^:{} toc:nil
:PROPERTIES:
:ID:       5d7e6b7b-e8e8-4c2b-918d-9aa3c5734aea
:END:
#+title: AB-SFC Ancona Summer School
#+date: 2022
#+HUGO_AUTO_SET_LASTMOD: t
#+hugo_base_dir: ~/BrainDump/
#+hugo_section: notes
#+HUGO_CATEGORIES: Lectures
#+PROPERTY: header-args: R  :session *ancona*
#+BIBLIOGRAPHY: ~/Org/zotero_refs.bib

*** The bisection method


1. specify initual values \(x_{lower} \leq x_{upper}\) such as \(f(x^{lower}) < f(x^{upper})\)
2. Compute the midpoint: \(x^{mid} = \frac{x^{lower} + x^{upper}}{2}\)
3. Update the bound:
   1. If \(f(x^{mid}) \cdot f(x^{upper}) < 0\) than \(x^{upper} = x^{mid}\). Do not change \(x^{lower}\)
   2. Otherwise \(x^{lower} = x^{mid}\). Do not change \(x^{upper}\)
4. Calculate the value of the function is the midpoint: \(|f(x^{mid}| \leq \delta)\)
5. If step 4 is true, get the final results, otherwise go back to step 2


#+BEGIN_SRC R
f <- function(x){
  x^2 - 1
    }


xl <- c()
xl[1] = 2
xu <- c()
xu[1] = 3
tol = 1e-6
delta_fun = 10
mid_point = 0
k = 1
delta_fun <- c()
delta_fun = 2

while(delta_fun[k] <= tol){

  f_l[k] <- f(xl[k])
  f_u[k] <- f(xu[k])
  mid_point[k] <- (xl[k] + xu[k])/2
  f_mid[k] <- f(mid_point[k])
  res <- f_mid[k] * f_u[k]
  if (res < 0){
    xu[k+1] <- midpoint[k]
    xl[k+1] <- xl[k+1]
  } else {
    xl[k+1] <- midpoint[k]
    xu[k+1] <- xu[k+1]
  }

  delta_fun[k + 1] <- f_mid[k]
  k = k + 1

  if(k > 100){
    print("Do not converged")
    break
  }

}

print(xl)
#+END_SRC

#+RESULTS:
: [1] 2

**** Libraries

#+begin_src R
library(sfcr)
library(ggraph)
#+end_src

#+RESULTS:
:results:
Carregando pacotes exigidos: ggplot2
:end:

**** Equations

#+begin_src R
eqs <- sfcr::sfcr_set(
               y ~ cons + i,
               pr ~  y - wb - dep,
               cw ~ wb,
               sc ~ ibc + divf + divb - cc,
               divf ~ pr - ibb,
               divb ~ ibb,
               yc ~ ibc + divf + divb,
               ibc ~ r*bc[-1],
               ibb ~ r*bb[-1],
               cons ~ cw + cc,
               wb ~ wshare * y,

               ## vc ~ d + bc,
               k ~ k[-1] + i  - depr*k[-1],
               dep ~ depr*k[-1],
               vc ~ vc[-1] + sc,

               cc ~ pc1*yc + pc2*vc[-1],
               b ~ b[-1] + i - dep,

               ## Portfolio decision
               bc ~ bc[-1] - bondssh*sc,
               bb ~ b - bc,
               d ~ bb,
               bondssh ~ 0.8

             )
#+end_src

#+RESULTS:
:results:
:end:

**** Exogenous parameters

This is the initial calibration of the model.
To do so, it is possible to choose a scale value (in this case, GDP).


|-------------------------+----------------+-----------+---------------+-----------------+-----------------+---------------+-----------|
|                         |   Production   |  Workers  |  Capitalists  | Firms (current) | Firms (Capital) |     Banks     |   Total   |
|-------------------------+----------------+-----------+---------------+-----------------+-----------------+---------------+-----------|
| <l>                     |      <c>       |    <c>    |      <c>      |       <c>       |       <c>       |      <c>      |    <c>    |
| Wages                   |  -60 (endog)   |  \(+WB\)  |               |                 |                 |               |     0     |
| Net profits             | -20 (residual) |           |               |     \(+PR\)     |                 |               |     0     |
| Depreciation            |      -20       |           |               |    \(+DEP\)     |                 |               |     0     |
|-------------------------+----------------+-----------+---------------+-----------------+-----------------+---------------+-----------|
| GDP (income)            |   100 (exog)   |           |               |                 |                 |               | \([GDP]\) |
|-------------------------+----------------+-----------+---------------+-----------------+-----------------+---------------+-----------|
| Interest on bonds       |                |           | \(+i\cdot B_{c}\) |    \(-i\cdot B\)    |                 | \(+i\cdot B_{b}\) |     0     |
| Firms Dividends         |                |           | \(+DIV_{f}\)  |  \(-DIV_{f}\)   |                 |               |     0     |
| Bank Dividends          |                |           | \(+DIV_{b}\)  |                 |                 | \(-DIV_{b}\)  |     0     |
|-------------------------+----------------+-----------+---------------+-----------------+-----------------+---------------+-----------|
| Consumption             |     \(+C\)     | \(C_{w}\) |   \(C_{c}\)   |                 |                 |               |     0     |
| Investment              |     \(+I\)     |           |               |                 |     \(-I\)      |               |           |
| Depreciation            |                |           |               |    \(-DEP\)     |    \(+DEP\)     |               |           |
|-------------------------+----------------+-----------+---------------+-----------------+-----------------+---------------+-----------|
| Change in bank deposits |                |           |   \(-\Delta D\)    |                 |                 |   \(+\Delta D\)    |           |
| Change in bonds         |                |           | \(-\Delta B_{c}\)  |  \(+\Delta B_{f}\)   |                 | \(-\Delta B_{b}\)  |           |
|-------------------------+----------------+-----------+---------------+-----------------+-----------------+---------------+-----------|
| Total                   |       0        |     0     |       0       |        0        |        0        |       0       |     0     |
|-------------------------+----------------+-----------+---------------+-----------------+-----------------+---------------+-----------|


|--------------+---------+-------------------------+--------------+-------+--------|
|              | Workers |       Capitalists       |    Firms     | Banks | Total  |
|--------------+---------+-------------------------+--------------+-------+--------|
| <l>          |   <c>   |           <c>           |     <c>      |  <c>  |  <c>   |
| Real capital |         |                         |  100 (exog)  |       | \(+K\) |
| Deposits     |         |      20 (residual)      |              |  -20  |   0    |
| Bonds        |         | 80 (assuming fix share) | -100 (endog) |  20   |   0    |
|--------------+---------+-------------------------+--------------+-------+--------|
| Total        |    0    |       100 (endog)       |      0       |   0   | \(+K\) |
|--------------+---------+-------------------------+--------------+-------+--------|

#+begin_src R
external <- sfcr::sfcr_set(
                    y0 ~ 100,
                    depr ~ 0.2,
                    wshare ~ 0.6,
                    pc1 ~ 0.25,
                    pc2 ~ 0.15, ## adds up

                    # Exogenous
                    i ~ 20, ## Because of time constraints
                    r ~ 0.1
)


init <- sfcr::sfcr_set(
                    # Lagged values
                    k ~ 100,
                    vc ~ 100,
                    bc ~ 80,
                    b ~ 100,
                  )
#+end_src

#+RESULTS:
:results:
:end:

**** Baseline solution

#+begin_src R :results table
growth <- sfcr::sfcr_baseline(
  equations = eqs,
  external = external,
  periods = 10,
  method = "Broyden"
)
as.data.frame(sfcr_get_blocks(growth))
#+end_src

#+RESULTS:
:results:
   endogenous block
1     bondssh     1
2         dep     2
3           b     3
4           k     4
5         ibb     5
6         ibc     6
7        divb     7
8           y     8
9          pr     8
10         cw     8
11       divf     8
12         yc     8
13       cons     8
14         wb     8
15         cc     8
16         sc     9
17         bc    10
18         bb    11
19          d    12
20         vc    13
:end:

*** Exogenenous parameter

#+begin_src R
Ni <- 100
Time <- 100

gamma <- 1.1
phi <- 0.1
r <- 0.1
Pbar <- 0.01
#+end_src

#+RESULTS:
:results:
:end:

*** Allocation variables and initial conditions

#+begin_src R

set.seed(15)
A <- matrix(data = 1, ncol = 1, nrow = Ni)
K <- matrix(data = 1, ncol = 1, nrow = Ni)
B <- matrix(data = 0, ncol = 1, nrow = Ni)
I <- matrix(data = 0, ncol = 1, nrow = Ni)
P <- matrix(data = 0, ncol = 1, nrow = Ni)
Y <- matrix(data = 0, ncol = 1, nrow = Ni)
Z <- matrix(data = 2 * runif(Ni) + Pbar, ncol = 1, nrow = Ni) ## Profits: if zero, there is no investment

## Aggregate variavles

YY <- matrix(data = 0, ncol = 1, nrow = Time)
AA <- matrix(data = 0, ncol = 1, nrow = Time)
BB <- matrix(data = 0, ncol = 1, nrow = Time)
lev <- matrix(data = 0, ncol = 1, nrow = Time)
#+end_src

#+RESULTS:
:results:
:end:

*** Sequence of events

#+begin_src R

for (t in 2 : Time){
  I <- gamma * Z
  K <- K + I
  Y <- phi * K
  B <- K - A
  B[B < 0] <- 0
  P <- 2 * runif(Ni) + Pbar
  Z <- P * Y - r * K
  A <- A + Z
  Z[A< 0] <- 0 # Entry condition
  K[A<0] <- 1
  A[A<0] <- 1
  YY[t] <- sum(Y)
  AA[t] <- sum(A)
  BB[t] <- sum(B)
  lev <- BB/AA
}

#+end_src

#+RESULTS:
:results:
:end:

*** Plots

#+begin_src R
## plot(2 : Time, YY[2 : Time], type = "l", ylim = range(YY[2:Time]), col = 1, ylab = "YY", xlab = "t")
plot(2 : Time, BB[2 : Time], type = "l", ylim = range(BB[2:Time]), col = 1, ylab = "BB", xlab = "t")
## plot(2 : Time, AA[2 : Time], type = "l", ylim = range(AA[2:Time]), col = 1, ylab = "AA", xlab = "t")
#+end_src

#+RESULTS:
:results:
:end:


**** Plot a measure of financial leverage

#+begin_src R :results figure

plot(2 : Time, lev[2 : Time], type = "l", ylim = range(lev[2:Time]), col = 1, ylab = "Leverage", xlab = "t")
#+end_src

#+RESULTS:
:results:
:end:

**** Exogenenous parameter

#+begin_src R
Ni <- 100
Time <- 100

gamma <- 2
phi <- 0.1
r <- 0.1
Pbar <- 0.01
delta <- 0.05
#+end_src

#+RESULTS:
:results:
:end:

**** Allocation variables and initial conditions

#+begin_src R

set.seed(15)
A <- matrix(data = 1, ncol = 1, nrow = Ni)
K <- matrix(data = 1, ncol = 1, nrow = Ni)
B <- matrix(data = 0, ncol = 1, nrow = Ni)
I <- matrix(data = 0, ncol = 1, nrow = Ni)
P <- matrix(data = 0, ncol = 1, nrow = Ni)
Y <- matrix(data = 0, ncol = 1, nrow = Ni)
Z <- matrix(data = 2 * runif(Ni) + Pbar, ncol = 1, nrow = Ni) ## Profits: if zero, there is no investment

## Aggregate variavles

YY <- matrix(data = 0, ncol = 1, nrow = Time)
AA <- matrix(data = 0, ncol = 1, nrow = Time)
BB <- matrix(data = 0, ncol = 1, nrow = Time)
lev <- matrix(data = 0, ncol = 1, nrow = Time)
#+end_src

#+RESULTS:
:results:
:end:

**** Sequence of events

#+begin_src R

for (t in 2 : Time){
  I <- gamma * Z
  I[I <0] <- 0 ## Before profits update
  K <- (1 - delta) * K + I
  Y <- phi * K
  B <- K - A
  B[B < 0] <- 0
  P <- 2 * runif(Ni) + Pbar
  Z <- P * Y - r * K
  A <- A + Z
  Z[A< 0] <- 0 # Entry condition
  K[A<0] <- 1
  A[A<0] <- 1
  YY[t] <- sum(Y)
  AA[t] <- sum(A)
  BB[t] <- sum(B)
  lev <- BB/AA
}

#+end_src

#+RESULTS:
:results:
:end:

**** Plots

#+begin_src R :results figure

plot(2 : Time, log(YY)[2 : Time], type = "l", ylim = range(log(YY)[2:Time]), col = 1, ylab = "g", xlab = "t")
#+end_src

#+RESULTS:
:results:
:end:

**** Exogenenous parameter

#+begin_src R
Ni <- 100
Time <- 100

gamma <- 2
phi <- 0.1
rbar <- 0.075
Pbar <- 0.01
delta <- 0.05
#+end_src

#+RESULTS:
:results:
:end:

**** Allocation variables and initial conditions

#+begin_src R

set.seed(15)
A <- matrix(data = 1, ncol = 1, nrow = Ni)
K <- matrix(data = 1, ncol = 1, nrow = Ni)
B <- matrix(data = 0, ncol = 1, nrow = Ni)
I <- matrix(data = 0, ncol = 1, nrow = Ni)
P <- matrix(data = 0, ncol = 1, nrow = Ni)
Y <- matrix(data = 0, ncol = 1, nrow = Ni)
Z <- matrix(data = 2 * runif(Ni) + Pbar, ncol = 1, nrow = Ni) ## Profits: if zero, there is no investment

## Aggregate variavles

YY <- matrix(data = 0, ncol = 1, nrow = Time)
AA <- matrix(data = 0, ncol = 1, nrow = Time)
BB <- matrix(data = 0, ncol = 1, nrow = Time)
lev <- matrix(data = 0, ncol = 1, nrow = Ni)
r <- matrix(data = 0, ncol = 1, nrow = Ni)
RR <- matrix(data = 0, ncol = 1, nrow = Time)
#+end_src

#+RESULTS:
:results:
:end:

**** Sequence of events

#+begin_src R

for (t in 2 : Time){
  I <- gamma * Z
  I[I <0] <- 0 ## Before profits update
  K <- (1 - delta) * K + I
  Y <- phi * K
  B <- K - A
  B[B < 0] <- 0
  P <- 2 * runif(Ni) + Pbar
  r <- rbar + rbar*(B/A)^rbar
  int <- r * B
  Z <- P * Y - r * K
  A <- A + Z
  Z[A< 0] <- 0 # Entry condition
  K[A<0] <- 1
  A[A<0] <- 1
  YY[t] <- sum(Y)
  AA[t] <- sum(A)
  BB[t] <- sum(B)
  lev <- BB/AA
  RR[t] <- sum(int)/sum(B)
}

#+end_src

#+RESULTS:
:results:
:end:

**** Plots

#+begin_src R :results figure

plot(2 : Time, RR[2 : Time], type = "l", ylim = range(RR[2:Time]), col = 1, ylab = "interest rate", xlab = "t")
#+end_src

#+RESULTS:
:results:
:end:


**** Exogenenous parameter

#+begin_src R
Ni <- 100
Time <- 1000
MC <- 3

gamma <- 2
phi <- 0.1
rbar <- 0.075
Pbar <- 0.01
delta <- 0.05
#+end_src

#+RESULTS:
:results:
:end:

**** Allocation variables and initial conditions

It is in

#+begin_src R
YY <- matrix(data = 0, ncol = MC, nrow = Time)
AA <- matrix(data = 0, ncol = MC, nrow = Time)
BB <- matrix(data = 0, ncol = MC, nrow = Time)
LEV <- matrix(data = 0, ncol = MC, nrow = Time)
#+end_src

#+RESULTS:
:results:
:end:

**** Sequence of events

#+begin_src R

set.seed(15)
for (mc in 1 : MC){
  A <- matrix(data = 1, ncol = 1, nrow = Ni)
  K <- matrix(data = 1, ncol = 1, nrow = Ni)
  B <- matrix(data = 0, ncol = 1, nrow = Ni)
  I <- matrix(data = 0, ncol = 1, nrow = Ni)
  P <- matrix(data = 0, ncol = 1, nrow = Ni)
  Y <- matrix(data = 0, ncol = 1, nrow = Ni)
  r <- matrix(data = 0, ncol = 1, nrow = Ni)
  Z <- matrix(data = 2 * runif(Ni) + Pbar, ncol = 1, nrow = Ni) ## Profits: if zero, there is no investment

  ## Aggregate variavles


  for (t in 2 : Time){
    I <- gamma * Z
    I[I< 0 ] <- 0
    K <- (1 - delta) * K + I
    Y <- phi * K
    B <- K - A
    B[B < 0] <- 0 ## Self-financed firms
    P <- 2 * runif(Ni) + Pbar
    r <- rbar + rbar*(B/A)^rbar
    Z <- P * Y - r * K
    A <- A + Z
    Z[A< 0] <- 0 # Entry condition
    K[A<0] <- 1
    A[A<0] <- 1
    YY[t, mc] <- sum(Y)
    AA[t, mc] <- sum(A)
    BB[t, mc] <- sum(B)
    LEV[t, mc] <- BB[t, mc]/AA[t, mc]
  }
}
#+end_src

#+RESULTS:
:results:
:end:

**** Plot

#+begin_src R
plot(2 : Time, YY[2: Time, 1], type = 'l', ylim = range(0, max(YY)), col = 1, ylab = 'YY', xlab = 't')
for(j in 2:MC){
  lines (2 : Time, YY[2: Time, j], type = 'l', ylim = range(0, max(YY)), col = j)
}
#+end_src

#+RESULTS:
:results:
:end:

**** Parameters

#+begin_src R
Time <- 100
#Number of firms
Ni <- 100


#PARAMETER SETTING
#Investment accelerator
gamma <- 1.1
#Capital productivity
phi <- 0.1
#Interest rate
r <- 0.1
#Random price constant
Pbar <- 0.01


#SEED
set.seed(15)

#+end_src

#+RESULTS:
:results:
:end:

**** Allocating varaibles

#+begin_src R

#ALLOCATING VARIABLES AND INITIAL CONDITIONS
#Firms’ net worth
A <- matrix(data=1,ncol=1,nrow=Ni)
#Firms’ capital
K <- matrix(data=1,ncol=1,nrow=Ni)
#Firms’ debt
B <- matrix(data=0,ncol=1,nrow=Ni)
#Firms’ investment
I <- matrix(data=0,ncol=1,nrow=Ni)
#Stochastic price
P <- matrix(data=0,ncol=1,nrow=Ni)
#Firms’ production
Y <- matrix(data=0,ncol=1,nrow=Ni)
#Firms’ profit
Z <- matrix(2*runif(Ni)+Pbar,ncol=1,nrow=Ni)
#Aggregate production
YY <- matrix(data=0,ncol=1,nrow=Time)
#AGGREGATE DEBT
BB <- matrix(data=0,ncol=1,nrow=Time)
#AGGREGATE NETWORTH
AA <- matrix(data=0,ncol=1,nrow=Time)
BB <- matrix(data=0,ncol=1,nrow=Time)
II <- matrix(data=0,ncol=1,nrow=Time)
ZZ <- matrix(data=0,ncol=1,nrow=Time)
KK <- matrix(data=0,ncol=1,nrow=Time)
DAA <- matrix(data=0,ncol=1,nrow=Time)
DBB <- matrix(data=0,ncol=1,nrow=Time)
PYY <- matrix(data=0,ncol=1,nrow=Time)
PII <- matrix(data=0,ncol=1,nrow=Time)
#+end_src

#+RESULTS:
:results:
:end:

**** Sequence

#+begin_src R

#SEQUENCE OF EVENTS
for (t in 2:Time) {
  I <- gamma * Z #Investment choice
  K <- K + I #Capital accumulation
  Y <- phi * K #Production
  B <- K - A #Debt
  B[B<0] <- 0 #Self-financed firms
  P <- 2*runif(Ni)+ Pbar #Stochastic price
  Z <- P * Y - r * K #Profit
  A <- A + Z #Net worth
  Z[A<0] <- 0 #Entry condition
  K[A<0] <- 1 #Entry condition
  A[A<0] <- 1 #Entry condition
  YY[t] <- sum(Y) #Aggregate production
  BB[t] <- sum(B) #Aggregate DEBT
  AA[t] <- sum(A) #Aggregate CAPITAL

  KK[t] <- sum(K)
  II[t] <- sum(I)
  ZZ[t] <- sum(Z)
  PYY[t] <- sum(P*Y)
  PII[t] <- sum(P*I)
  DAA[t] <-AA[t] - AA[t-1]
  DBB[t] <-BB[t] - BB[t-1]


}
#+end_src

#+RESULTS:
:results:
:end:

